---
kind: other
id: Methods.T:Autodesk.Revit.DB.CompoundStructure
source: html/3731d7d5-cef4-87ef-24fb-6db7ea4ca36e.htm
---
# CompoundStructure Methods

Adds a new wall sweep or reveal to the compound structure.